# Import data

In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
xls = pd.ExcelFile('Sample - Superstore.xls')

In [3]:
df_orders = pd.read_excel(xls, 'Orders')
df_orders.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2020-138688,2020-06-12,2020-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [4]:
df_people = pd.read_excel(xls, 'People')
df_people.head()

    Regional Manager   Region
0    Sadie Pawthorne     West
1        Chuck Magee     East
2  Roxanne Rodriguez  Central
3        Fred Suzuki    South

In [5]:
df_returns = pd.read_excel(xls, 'Returns')
df_returns.head()

  Returned        Order ID
0      Yes  CA-2018-100762
1      Yes  CA-2018-100762
2      Yes  CA-2018-100762
3      Yes  CA-2018-100762
4      Yes  CA-2018-100867

# customers table

In [6]:
customers_df = df_orders[['Customer ID', 'Customer Name', 'Segment']]
customers_df.columns = ['customer_id', 'customer_name', 'segment']
customers_df.head()

  customer_id    customer_name    segment
0    CG-12520      Claire Gute   Consumer
1    CG-12520      Claire Gute   Consumer
2    DV-13045  Darrin Van Huff  Corporate
3    SO-20335   Sean O'Donnell   Consumer
4    SO-20335   Sean O'Donnell   Consumer

In [7]:
# Drop duplicates
customers_df['is_duplicate'] = customers_df.duplicated()
customers_df = customers_df[~customers_df['is_duplicate']]
customers_df.drop('is_duplicate', axis=1, inplace=True)
customers_df.head()

/tmp/ipykernel_3915/1949147953.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_df['is_duplicate'] = customers_df.duplicated()

   customer_id    customer_name    segment
0     CG-12520      Claire Gute   Consumer
2     DV-13045  Darrin Van Huff  Corporate
3     SO-20335   Sean O'Donnell   Consumer
5     BH-11710  Brosina Hoffman   Consumer
12    AA-10480     Andrew Allen   Consumer

In [8]:
import mysql.connector
from sqlalchemy import create_engine

In [9]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="1234",
    database="GBC_Superstore"
)
cursor = conn.cursor()

In [10]:
engine = create_engine('mysql+mysqlconnector://root:1234@localhost/GBC_Superstore')

In [11]:
customers_df.to_sql(name='customers', con=engine, if_exists='append', index=False)

793

# regions table

In [12]:
df_regions = df_people.copy(deep=True)
df_regions.columns = ['regional_manager', 'region']
df_regions.index += 1
df_regions['region_id'] = df_regions.index
df_regions.to_sql(name='regions', con=engine, if_exists='append', index=False)

4

# orders table

In [13]:
df_orders_table = df_orders[['Order ID', 'Order Date', 'Ship Date', 'Ship Mode', 'Customer ID', 'City', 'State', 'Postal Code', 'Region']]
df_orders_table.head()

,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,City,State,Postal Code,Region
0,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Henderson,Kentucky,42420.0,South
1,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Henderson,Kentucky,42420.0,South
2,CA-2020-138688,2020-06-12,2020-06-16,Second Class,DV-13045,Los Angeles,California,90036.0,West
3,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Fort Lauderdale,Florida,33311.0,South
4,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Fort Lauderdale,Florida,33311.0,South

In [14]:
df_returns['is_duplicate'] = df_returns.duplicated()
df_returns = df_returns[~df_returns['is_duplicate']]
df_returns.drop('is_duplicate', axis=1, inplace=True)
df_returns.head()

   Returned        Order ID
0       Yes  CA-2018-100762
4       Yes  CA-2018-100867
5       Yes  CA-2018-102652
9       Yes  CA-2018-103373
10      Yes  CA-2018-103744

In [15]:
# Get foreign key colums and rename columns
df_orders_table_merged = df_orders_table.merge(df_returns,on='Order ID', how='left')
df_orders_table_merged = df_orders_table_merged.merge(df_regions,left_on='Region', right_on='region', how='left')
df_orders_table_merged.drop(['Region', 'regional_manager', 'region'], axis=1, inplace=True)
df_orders_table_merged.columns = ['order_id', 'order_date', 'ship_date', 'ship_mode', 'customer_id', 'city', 'state', 'postal_code', 'returned', 'region_id']
df_orders_table_merged.head()

,order_id,order_date,ship_date,ship_mode,customer_id,city,state,postal_code,returned,region_id
0,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Henderson,Kentucky,42420.0,NaN,4
1,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Henderson,Kentucky,42420.0,NaN,4
2,CA-2020-138688,2020-06-12,2020-06-16,Second Class,DV-13045,Los Angeles,California,90036.0,NaN,1
3,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Fort Lauderdale,Florida,33311.0,NaN,4
4,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Fort Lauderdale,Florida,33311.0,NaN,4

In [16]:
# Drop duplicates
df_orders_table_merged['is_duplicate'] = df_orders_table_merged.duplicated()
df_orders_table_merged = df_orders_table_merged[~df_orders_table_merged['is_duplicate']]
df_orders_table_merged.drop('is_duplicate', axis=1, inplace=True)
df_orders_table_merged.head()

,order_id,order_date,ship_date,ship_mode,customer_id,city,state,postal_code,returned,region_id
0,CA-2020-152156,2020-11-08,2020-11-11,Second Class,CG-12520,Henderson,Kentucky,42420.0,NaN,4
2,CA-2020-138688,2020-06-12,2020-06-16,Second Class,DV-13045,Los Angeles,California,90036.0,NaN,1
3,US-2019-108966,2019-10-11,2019-10-18,Standard Class,SO-20335,Fort Lauderdale,Florida,33311.0,NaN,4
5,CA-2018-115812,2018-06-09,2018-06-14,Standard Class,BH-11710,Los Angeles,California,90032.0,NaN,1
12,CA-2021-114412,2021-04-15,2021-04-20,Standard Class,AA-10480,Concord,North Carolina,28027.0,NaN,4

In [17]:
df_orders_table_merged.to_sql(name='orders', con=engine, if_exists='append', index=False)

5009

# products table

In [18]:
df_products = df_orders[['Product ID', 'Category', 'Sub-Category', 'Product Name']].copy(deep=True)
df_products.columns = ['product_id', 'category', 'sub_category', 'product_name']
df_products.head()

,product_id,category,sub_category,product_name
0,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase
1,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,..."
2,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
3,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table
4,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System

In [19]:
# Drop duplictates.
# There are more than one product_name with the same product_id, so we assume the name that appears first as the real name and drop the remaining ones.
df_products['is_duplicate'] = df_products.duplicated(subset=['product_id', 'category', 'sub_category'])
df_products = df_products[~df_products['is_duplicate']]
df_products.drop('is_duplicate', axis=1, inplace=True)
df_products.head()

,product_id,category,sub_category,product_name
0,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase
1,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,..."
2,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...
3,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table
4,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System

In [20]:
df_products.to_sql(name='products', con=engine, if_exists='append', index=False)

1862

# orders_products

In [21]:
df_orders_products = df_orders[['Order ID', 'Product ID', 'Sales', 'Quantity', 'Discount', 'Profit']].copy(deep=True)
df_orders_products.columns = ['order_id', 'product_id', 'sales', 'quantity', 'discount', 'profit']
df_orders_products.head()

         order_id       product_id     sales  quantity  discount    profit
0  CA-2020-152156  FUR-BO-10001798  261.9600         2      0.00   41.9136
1  CA-2020-152156  FUR-CH-10000454  731.9400         3      0.00  219.5820
2  CA-2020-138688  OFF-LA-10000240   14.6200         2      0.00    6.8714
3  US-2019-108966  FUR-TA-10000577  957.5775         5      0.45 -383.0310
4  US-2019-108966  OFF-ST-10000760   22.3680         2      0.20    2.5164

In [22]:
# Drop duplicates
df_orders_products['is_duplicate'] = df_orders_products.duplicated()
df_orders_products = df_orders_products[~df_orders_products['is_duplicate']]
df_orders_products.drop('is_duplicate', axis=1, inplace=True)
df_orders_products.head()

         order_id       product_id     sales  quantity  discount    profit
0  CA-2020-152156  FUR-BO-10001798  261.9600         2      0.00   41.9136
1  CA-2020-152156  FUR-CH-10000454  731.9400         3      0.00  219.5820
2  CA-2020-138688  OFF-LA-10000240   14.6200         2      0.00    6.8714
3  US-2019-108966  FUR-TA-10000577  957.5775         5      0.45 -383.0310
4  US-2019-108966  OFF-ST-10000760   22.3680         2      0.20    2.5164

In [23]:
df_orders_products.to_sql(name='orders_products', con=engine, if_exists='append', index=False)

9993